<a href="https://colab.research.google.com/github/amitpathakjec/Machine-Learning/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### **Pandas**
Pandas is an open source, BSD-licensed liabrary prvoding high-performance, easy to use data structures and data analysis tools for the python programming language.

### Agenda


*   What is Data Frames?
*   What is Data Series?
*   Different operations in Pandas.

In [0]:
# First step is to  import pandas

import pandas as pd
import numpy as np

In [0]:
# Playing with Dataframes

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Coumn4"])

## pd.DataFrame(data=None, index: Union[Collection, NoneType]=None, columns: Union[Collection, NoneType]=None, dtype: Union[str, numpy.dtype, _ForwardRef('ExtensionDtype'), NoneType]=None, copy: bool=False)

In [5]:
print()
df.head

<bound method NDFrame.head of       Column1  Column2  Column3  Coumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19>

In [0]:
# We can also convert the data frame to excel file.
# df.to_csv(Test1.csv)

**Accessing the element**

*   .loc   # location
*   .iloc  # index location

In [7]:
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Coumn4     3
Name: Row1, dtype: int64

In [8]:
# Check the type
type(df.loc['Row1'])

pandas.core.series.Series

In [9]:
df.iloc[:,:]

      Column1  Column2  Column3  Coumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [10]:
df.iloc[0:3,0:2]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9

In R programming language the indexes start from 1 while in Python programming llanguage the indexes start from 0.

In [11]:
type(df.iloc[0:3,0:2])

pandas.core.frame.DataFrame

In [12]:
df.iloc[0:2,0:1]

      Column1
Row1        0
Row2        4

In [13]:
# Take the element from column 2
df.iloc[0:4,1:2]

      Column2
Row1        1
Row2        5
Row3        9
Row4       13

In [14]:
# Skipping a particular column
df.iloc[:,1:]

      Column2  Column3  Coumn4
Row1        1        2       3
Row2        5        6       7
Row3        9       10      11
Row4       13       14      15
Row5       17       18      19

In [15]:
df['Column3']

Row1     2
Row2     6
Row3    10
Row4    14
Row5    18
Name: Column3, dtype: int64

In [16]:
# In order to get two columns as output you need tp get the output as a list
df[['Column1','Column3']]

      Column1  Column3
Row1        0        2
Row2        4        6
Row3        8       10
Row4       12       14
Row5       16       18

In [17]:
#  Convert DataFrame into Arrays using .values
df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [18]:
df.iloc[:,:].values.shape

(5, 4)

In [19]:
df

      Column1  Column2  Column3  Coumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [20]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])

In [21]:

df['Column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: Column1, dtype: int64

In [22]:
from google.colab import files
uploaded = files.upload()

In [23]:
# There are so many read functions starting with read_....

df=pd.read_csv('mercedesbenz.csv'# , sep = ';' )

# If the file is seprated by something other than the commas then you can mention the seprator parameter explicitly.

SyntaxError: ignored

In [0]:
df.head()

In [0]:
df.info()

In [0]:
df.describe()   
# Only numeric or columns with num values are taken into consideration and the columns with object(categorial features) are ignored.

In [0]:
# Get the unique category counts
df['X0'].value_counts()

In [0]:
df[df['y']>100]

In [0]:
df['X11'].value_counts()

**CSV**

In [0]:
from io import StringIO, BytesIO

In [0]:
data = ('col1,col2,col3\n'
          'x  , y , 1 \n'
          'a  , b , 2 \n'
          'c  , d , 3 '  )

In [0]:
type(data)

In [0]:
StringIO()

In [0]:
pd.read_csv(StringIO(data))

In [0]:
# Read from specific columns
df = pd.read_csv(StringIO(data), usecols=['col1' , 'col3'])

In [0]:
df

In [0]:
df.to_csv('Test.csv')

In [0]:
# Specifying columns data types
data = ('a,b,c,d\n'
        '1,2,3,4\n'
        '5,6,7,8\n'
        '9,10,11')

In [0]:
print(data)

In [0]:
# df = pd.read_csv(StringIO(data),dtype = object) # object means str.
  df = pd.read_csv(StringIO(data),dtype = float)

In [0]:
df

In [0]:
print(df['a'][1])
print(type(df['a'][1]))

In [0]:
df['a']

In [0]:
df=pd.read_csv(StringIO(data),dtype={'b':int,'c':float,'a':'Int64'})

In [0]:
df

In [0]:
# Check the  datatype
df.dtypes

In [0]:
# Index Columns and training delimiters

In [0]:

data = ('index,   a,       b,   c   \n'
        '4,       apple,   bat, 5.7 \n'
        '8,       orange,  cow, 10  ')

In [0]:
print(data)

In [0]:
df = pd.read_csv(StringIO(data),index_col = 0   #0th column becomes row index )
df

In [0]:

data = (  'a,b,c       \n'
          '4,apple,bat,\n'
          '8,orange,cow,')

In [0]:
pd.read_csv(StringIO(data))

In [0]:
pd.read_csv(StringIO(data),index_col = False) # Here no column become row  index

In [0]:
# Combining usecols and index_col

data = ('a,b,c         \n'
        '4,apple,bat,  \n'
        '8,orange,cow, ')

In [0]:
pd.read_csv(StringIO(data),index_col=False,  usecols=['b'])

In [0]:
# Quoting and Escape characters (escapechar), very useful in NLP

data = 'a,b\n"hello, \\"Bob\\", nice to see you",5'

In [0]:
pd.read_csv(StringIO(data),escapechar = '\\')

In [0]:
# URL to CSV

df = pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item', sep='\t')

In [0]:
df.head()

In [0]:
# read JSON to CSV

Data = '{"employee_name": "James", "email": "james@gmail.com", "job_profile": [{"title1":"Team Lead", "title2":"Sr. Developer"}]}'

In [37]:
df = pd.read_json(Data)
df

  employee_name  ...                                        job_profile
0         James  ...  {'title1': 'Team Lead', 'title2': 'Sr. Develop...

[1 rows x 3 columns]

In [0]:
# We can also read it from url without even downloading it.
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data', header=None)

In [29]:
df.head

<bound method NDFrame.head of      0      1     2     3     4    5   ...    8     9      10    11    12    13
0     1  14.23  1.71  2.43  15.6  127  ...  0.28  2.29   5.64  1.04  3.92  1065
1     1  13.20  1.78  2.14  11.2  100  ...  0.26  1.28   4.38  1.05  3.40  1050
2     1  13.16  2.36  2.67  18.6  101  ...  0.30  2.81   5.68  1.03  3.17  1185
3     1  14.37  1.95  2.50  16.8  113  ...  0.24  2.18   7.80  0.86  3.45  1480
4     1  13.24  2.59  2.87  21.0  118  ...  0.39  1.82   4.32  1.04  2.93   735
..   ..    ...   ...   ...   ...  ...  ...   ...   ...    ...   ...   ...   ...
173   3  13.71  5.65  2.45  20.5   95  ...  0.52  1.06   7.70  0.64  1.74   740
174   3  13.40  3.91  2.48  23.0  102  ...  0.43  1.41   7.30  0.70  1.56   750
175   3  13.27  4.28  2.26  20.0  120  ...  0.43  1.35  10.20  0.59  1.56   835
176   3  13.17  2.59  2.37  20.0  120  ...  0.53  1.46   9.30  0.60  1.62   840
177   3  14.13  4.10  2.74  24.5   96  ...  0.56  1.35   9.20  0.61  1.60   560

[178 rows x 14 columns]>

In [0]:
# Convert Json to csv
df.to_csv('wine.csv')

In [33]:
df.head

<bound method NDFrame.head of      0      1     2     3     4    5   ...    8     9      10    11    12    13
0     1  14.23  1.71  2.43  15.6  127  ...  0.28  2.29   5.64  1.04  3.92  1065
1     1  13.20  1.78  2.14  11.2  100  ...  0.26  1.28   4.38  1.05  3.40  1050
2     1  13.16  2.36  2.67  18.6  101  ...  0.30  2.81   5.68  1.03  3.17  1185
3     1  14.37  1.95  2.50  16.8  113  ...  0.24  2.18   7.80  0.86  3.45  1480
4     1  13.24  2.59  2.87  21.0  118  ...  0.39  1.82   4.32  1.04  2.93   735
..   ..    ...   ...   ...   ...  ...  ...   ...   ...    ...   ...   ...   ...
173   3  13.71  5.65  2.45  20.5   95  ...  0.52  1.06   7.70  0.64  1.74   740
174   3  13.40  3.91  2.48  23.0  102  ...  0.43  1.41   7.30  0.70  1.56   750
175   3  13.27  4.28  2.26  20.0  120  ...  0.43  1.35  10.20  0.59  1.56   835
176   3  13.17  2.59  2.37  20.0  120  ...  0.53  1.46   9.30  0.60  1.62   840
177   3  14.13  4.10  2.74  24.5   96  ...  0.56  1.35   9.20  0.61  1.60   560

[178 rows x 14 columns]>

In [35]:
# Convert Json to different json formats
df.to_json(orient = "index")
print(df)

     0      1     2     3     4    5   ...    8     9      10    11    12    13
0     1  14.23  1.71  2.43  15.6  127  ...  0.28  2.29   5.64  1.04  3.92  1065
1     1  13.20  1.78  2.14  11.2  100  ...  0.26  1.28   4.38  1.05  3.40  1050
2     1  13.16  2.36  2.67  18.6  101  ...  0.30  2.81   5.68  1.03  3.17  1185
3     1  14.37  1.95  2.50  16.8  113  ...  0.24  2.18   7.80  0.86  3.45  1480
4     1  13.24  2.59  2.87  21.0  118  ...  0.39  1.82   4.32  1.04  2.93   735
..   ..    ...   ...   ...   ...  ...  ...   ...   ...    ...   ...   ...   ...
173   3  13.71  5.65  2.45  20.5   95  ...  0.52  1.06   7.70  0.64  1.74   740
174   3  13.40  3.91  2.48  23.0  102  ...  0.43  1.41   7.30  0.70  1.56   750
175   3  13.27  4.28  2.26  20.0  120  ...  0.43  1.35  10.20  0.59  1.56   835
176   3  13.17  2.59  2.37  20.0  120  ...  0.53  1.46   9.30  0.60  1.62   840
177   3  14.13  4.10  2.74  24.5   96  ...  0.56  1.35   9.20  0.61  1.60   560

[178 rows x 14 columns]

In [39]:
df.to_json(orient = "records")
print(df)

  employee_name  ...                                        job_profile
0         James  ...  {'title1': 'Team Lead', 'title2': 'Sr. Develop...

[1 rows x 3 columns]

**Reading HTML  content**

In [0]:
# We are  basically reading the tables from html page, also this is a web scraping technique.

url = 'https://www.fdic.gov/bank/individual/failed/banklist.html'
dfs = pd.read_html(url)

In [44]:
dfs[0]

                             Bank Name  ...       Closing Date
0                 The First State Bank  ...      April 3, 2020
1                   Ericson State Bank  ...  February 14, 2020
2     City National Bank of New Jersey  ...   November 1, 2019
3                        Resolute Bank  ...   October 25, 2019
4                Louisa Community Bank  ...   October 25, 2019
..                                 ...  ...                ...
556                 Superior Bank, FSB  ...      July 27, 2001
557                Malta National Bank  ...        May 3, 2001
558    First Alliance Bank & Trust Co.  ...   February 2, 2001
559  National State Bank of Metropolis  ...  December 14, 2000
560                   Bank of Honolulu  ...   October 13, 2000

[561 rows x 6 columns]

In [0]:

url_mcc = 'https://en.wikipedia.org/wiki/Mobile_country_code'
dfs = pd.read_html(url_mcc, match='Mobile Network Codes', header=0) 

# With the help of matching column the entire table is picked up

In [49]:
dfs[0]

     Mobile Country Code  ...                   Remarks
0                    289  ...  MCC is not listed by ITU
1                    412  ...                       NaN
2                    276  ...                       NaN
3                    603  ...                       NaN
4                    544  ...                       NaN
..                   ...  ...                       ...
247                  452  ...                       NaN
248                  543  ...                       NaN
249                  421  ...                       NaN
250                  645  ...                       NaN
251                  648  ...                       NaN

[252 rows x 6 columns]

**Reading Excel Files**

In [53]:
from google.colab import files
uploaded = files.upload()

Saving Data Structures_Plan.xlsx to Data Structures_Plan.xlsx

In [0]:
df_excel = pd.read_excel('Data Structures_Plan.xlsx')

In [56]:
df_excel.head()

   Day No.       Date         Task Time Given  Check
0        1 2020-04-26      Arrays    05-hours    NaN
1        2 2020-04-27      Arrays    05-hours    NaN
2        3 2020-04-28  Linked List   05-hours    NaN
3        4 2020-04-29  Linked List   05-hours    NaN
4        5 2020-04-30        Stack   05-hours    NaN

**Pickling**

All pandas objects are equipped with to_pickle methods which use Pythons cPickle module to save data structures to disk using the pickle format.

In [0]:
# Basically we save the data in the disk by using .to_pickle

df_excel.to_pickle('df_excel')

In [0]:
df = pd.read_pickle('df_excel')

In [59]:
df.head()

   Day No.       Date         Task Time Given  Check
0        1 2020-04-26      Arrays    05-hours    NaN
1        2 2020-04-27      Arrays    05-hours    NaN
2        3 2020-04-28  Linked List   05-hours    NaN
3        4 2020-04-29  Linked List   05-hours    NaN
4        5 2020-04-30        Stack   05-hours    NaN